{"/about/":{"data":{"":"Soy Emilio Junoy, un estudiante de la licenciatura en matemáticas de la UNAM que está realizando su tesis de licenciatura en el campo de la teoría homotópica de tipos. Me interesa la computación y las matemáticas, en especial la inteligencia artificial, la ciberseguridad, la topología, la teoría de categorías y la teoría de tipos."},"title":"¿Quién soy?"},"/notas/":{"data":{"":"Esta es la sección donde guardo mis notas. Por ahora, puedes encontrar los siguientes temas:\nTeoría de tipos"},"title":"Notas"},"/notas/tipos/":{"data":{"":"Estas son mis notas sobre teoría de tipos. Por ahora aquí puedes encontrar los siguientes sub-temas Introducción a la teoría homotópica de tipos (Rijke)"},"title":"Tipos"},"/notas/tipos/rijke/":{"data":{"":"Estas son mis notas sobre el libro “Introducción a la teoría homotópica de tipos” de Rijke.\nTeoría de tipos dependiente funciones-dependientes"},"title":"Rijke"},"/notas/tipos/rijke/dependiente/":{"data":{"":"La teoría de tipos dependiente es un conjunto de reglas de inferencia que se pueden combinar para crear derivaciones. El objetivo de estas derivaciones es frecuentemente construir un elemento de un cierto tipo. En cierto sentido, un tipo no es más que una colección de objetos matemáticos y construir elementos de un cierto tipo es el desafío matemático del día a día. y construir elementos de un cierto tipo es el desafío matemático del día a día.","familias-de-tipos#Familias de tipos":"Definición 1.2.1: Consideremos un tipo AAA en un contexto Γ\\GammaΓ. Una famlia de tipos sobre AAA en el contexto Γ\\GammaΓ es un tipo B(x)B(x)B(x) en el contexto Γ,x:A\\Gamma, x: AΓ,x:A. En otras palabras, en la situación en la que Γ,x:A⊢B(x) type\\Gamma, x: A \\vdash B(x) ~~~ \\text{type}Γ,x:A⊢B(x) type, decimos que BBB es una familia de tipos sobre AAA en el contexto Γ\\GammaΓ. Alternativamente, decimos que B(x)B(x)B(x) es un tipo indizado por x:Ax: Ax:A en el contexto Γ\\GammaΓ. Un ejemplo básico de familia de tipos ocurrirá cuando intrdouzcamos los tipos identidad. Se introducen como sigue: Γ⊢a:AΓ,x:A⊢a=x type. \\frac{\\Gamma \\vdash a: A}{\\Gamma, x: A \\vdash a = x ~~~ \\text{type}}. Γ,x:A⊢a=x typeΓ⊢a:A​. Esta regla asegura que dado un elemento a:Aa: Aa:A en un contexto Γ\\GammaΓ, podemos formar el tipo a=xa = xa=x en el contexto Γ,x:A\\Gamma, x: AΓ,x:A. El tipo a=xa = xa=x en el contexto Γ,x:A\\Gamma, x: AΓ,x:A es un ejemplo de una familia de tipos sobre AAA en el contexto Γ\\GammaΓ.\nDefinición 1.2.2: Consideremos una familia de tipos BBB sobre AAA en un contexto Γ\\GammaΓ. Una sección de la familia BBB sobre AAA en el contexto Γ\\GammaΓ es un elemento de tipo B(x)B(x)B(x) en el contexto Γ,x:A\\Gamma, x: AΓ,x:A, es decir, en el juicio Γ,x:A⊢b(x):B(x). \\Gamma, x: A \\vdash b(x): B(x). Γ,x:A⊢b(x):B(x). Decimos que bbb es una sección de la familia BBB sobre AAA en el contexto Γ\\GammaΓ. Alternativamente, decimos que b(x)b(x)b(x) es un elemento de tipo B(x)B(x)B(x) indizado por x:Ax: Ax:A en el contexto Γ\\GammaΓ.","juicios-y-contextos#Juicios y contextos":"Un argumento matemático consiste de una sucesión de pasos, cada uno con una cantidad finita de premisas para llegar a la siguiente etapa de la demostración o construcción. Estos pasos se pueden representar mediante reglas de inferencia, que se escriben en la forma H1 H2…HnC \\frac{\\mathcal{H}_1 ~~~ \\mathcal{H}_2 \\ldots \\mathcal{H}_n}{\\mathcal{C}} CH1​ H2​…Hn​​ Arriba de la línea horizontal hay una lista finita de juicios como las premisas y, debajo, un sólo juicio llamado la conclusión. El sistema de la teoría de tipos está descrito por una serie de reglas de inferencias.\nUn ejemplo de regla de inferencia lo obtenemos con los tipos función: Γ⊢a:A Γ⊢f:A→BΓ⊢f(a):B. \\frac{\\Gamma \\vdash a: A ~~~ \\Gamma \\vdash f: A \\to B}{\\Gamma \\vdash f(a): B}. Γ⊢f(a):BΓ⊢a:A Γ⊢f:A→B​. Esta regla afirma que en un contexto Γ\\GammaΓ podemos usar un elemento a:Aa: Aa:A y una función f:A→Bf: A \\to Bf:A→B para obtener un elemento f(a):Bf(a): Bf(a):B. Cada una de las expresiones\nΓ⊢a:A\\Gamma \\vdash a: AΓ⊢a:A Γ⊢f:A→B\\Gamma \\vdash f: A \\to BΓ⊢f:A→B Γ⊢f(a):B\\Gamma \\vdash f(a): BΓ⊢f(a):B son ejemplos de juicios.\nDefinición 1.1.1: Hay cuatro tipos de juicios en la teoría de tipos de Marrtin-Löf:\nAAA es un tipo\"(bien formado) en un contexto Γ\\GammaΓ. Expresamos este juicio como Γ⊢A type. \\Gamma \\vdash A ~~~ \\text{type}. Γ⊢A type. AAA y BBB son tipos juiciosamente iguales en un contexto Γ\\GammaΓ. Expresamos este juicio como Γ⊢A=⋅B type\\Gamma \\vdash A \\stackrel{\\cdot}{=} B ~~~ \\text{type}Γ⊢A=⋅B type aaa es un elemento de tipo AAA en un contexto Γ\\GammaΓ. Expresamos este juicio como Γ⊢a:A. \\Gamma \\vdash a: A. Γ⊢a:A. aaa y bbb son elementos juiciosamente iguales de tipo AAA en un contexto Γ\\GammaΓ. Expresamos este juicio como Γ⊢a=⋅b:A. \\Gamma \\vdash a \\stackrel{\\cdot}{=} b: A. Γ⊢a=⋅b:A. Observemos que cualquier juicio es de la forma Γ⊢J\\Gamma \\vdash \\mathcal{J}Γ⊢J, donde Γ\\GammaΓ es un contexto y J\\mathcal{J}J es una tesis de juicio con una de las formas que mencionamos antes. El rol del contexto es declarar los elementos hipotéticos que son asumidos junto con sus tipos. Los elementos hipotéticos también son llamados variables.\nDefinición 1.1.2: Un contexto es una lista finita de declaraciones de variables x1:A1,x2:A2(x1),…,xn:An(x1,…,xn−1) x_1: A_1, x_2: A_2(x_1), \\ldots, x_n: A_n(x_1, \\ldots, x_{n-1}) x1​:A1​,x2​:A2​(x1​),…,xn​:An​(x1​,…,xn−1​) que satisface la condición de que para cada 1≤k≤n1 \\leq k \\leq n1≤k≤n podemos derivar el juicio x1:A1,…,xk−1:Ak−1(x1,…,xk−2)⊢Ak(x1,…,xk−1) type x_1: A_1, \\ldots, x_{k-1}: A_{k-1}(x_1, \\ldots, x_{k-2}) \\vdash A_k(x_1, \\ldots, x_{k-1}) ~~~ \\text{type} x1​:A1​,…,xk−1​:Ak−1​(x1​,…,xk−2​)⊢Ak​(x1​,…,xk−1​) type usando las reglas de inferencia de la teoría de tipos.\nLa condición en la definición 1.1.2 de que cada elemento hipotético tiene un tipo asignado, se verifica recursivamente.","la-igualdad-juiciosa-es-una-regla-de-equivalencia#La igualdad juiciosa es una regla de equivalencia":"Las reglas que postulan que la igualdad juiciosa en tipos y elementos es una relación de equivalencia son las siguientes:\nΓ⊢A typeΓ⊢A=⋅A typeΓ⊢A=⋅B typeΓ⊢B=⋅A typeΓ⊢A=⋅B type Γ⊢B=⋅C typeΓ⊢A=⋅C type \\begin{array}{ccc} \\dfrac{\\Gamma \\vdash A ~~~ \\text{type}}{\\Gamma \\vdash A \\stackrel{\\cdot}{=} A ~~~ \\text{type}} \u0026 \\dfrac{\\Gamma \\vdash A \\stackrel{\\cdot}{=} B ~~~ \\text{type}}{\\Gamma \\vdash B \\stackrel{\\cdot}{=} A ~~~ \\text{type}} \u0026 \\dfrac{\\Gamma \\vdash A \\stackrel{\\cdot}{=} B ~~~ \\text{type} ~~~ ~~~ \\Gamma \\vdash B \\stackrel{\\cdot}{=} C ~~~ \\text{type}}{\\Gamma \\vdash A \\stackrel{\\cdot}{=} C ~~~ \\text{type}} \\\\ \u0026 \u0026 \\\\ \\end{array} Γ⊢A=⋅A typeΓ⊢A type​​Γ⊢B=⋅A typeΓ⊢A=⋅B type​​Γ⊢A=⋅C typeΓ⊢A=⋅B type Γ⊢B=⋅C type​​","reglas-de-inferencia#Reglas de inferencia":"Ahora estamos listos para presentar el sistema de reglas de inferencia que conforman la teoría de tipos. Estas reglas son conocidas como reglas estructurales de la teoría de tipos. Hay seis conjuntos de reglas de inferencia:\nReglas sobre la formación de contextos, tipos y sus elementos. Reglas que postulan que la igualdad juiciosa es una relación de equivalencia. Reglas de conversión de variables. Reglas de substitución. Reglas de debilitamiento. El elemento genérico.","reglas-sobre-formación-de-contextos-tipos-y-sus-elementos#Reglas sobre formación de contextos, tipos y sus elementos":"Las siguientes reglas se siguen de las suposiciones sobre contextos, tipos y sus elementos y pueden usarse libremente en las derivaciones:\nΓ,x:A⊢B(x) typeΓ⊢A typeΓ⊢A=⋅B typeΓ⊢A typeΓ⊢A=⋅B typeΓ⊢B typeΓ⊢a:AΓ⊢A typeΓ⊢a=⋅bΓ⊢a:AΓ⊢a=⋅bΓ⊢b:A \\begin{array}{ccc} \\dfrac{\\Gamma, x: A \\vdash B(x) ~~~ \\text{type}}{\\Gamma \\vdash A ~~~ \\text{type}} \u0026 \\dfrac{\\Gamma \\vdash A \\stackrel{\\cdot}{=} B ~~~ \\text{type}}{\\Gamma \\vdash A ~~~ \\text{type}} \u0026 \\dfrac{\\Gamma \\vdash A \\stackrel{\\cdot}{=} B ~~~ \\text{type}}{\\Gamma \\vdash B ~~~ \\text{type}} \\\\ \u0026 \u0026 \\\\ \\dfrac{\\Gamma \\vdash a: A}{\\Gamma \\vdash A ~~~ \\text{type}} \u0026 \\dfrac{\\Gamma \\vdash a \\stackrel{\\cdot}{=} b}{\\Gamma \\vdash a: A} \u0026 \\dfrac{\\Gamma \\vdash a \\stackrel{\\cdot}{=} b}{\\Gamma \\vdash b: A} \\end{array} Γ⊢A typeΓ,x:A⊢B(x) type​Γ⊢A typeΓ⊢a:A​​Γ⊢A typeΓ⊢A=⋅B type​Γ⊢a:AΓ⊢a=⋅b​​Γ⊢B typeΓ⊢A=⋅B type​Γ⊢b:AΓ⊢a=⋅b​​"},"title":"Teoría de tipos dependiente"},"/notas/tipos/rijke/funciones-dependientes/":{"data":{"":"","la-regla-de--formación#La regla de -formación":"","la-regla-de--introducción#La regla de -introducción":"Consideremos una sección bbb sobre AAA en un contexto Γ\\GammaΓ,es decir, consideremos Γ,x:A⊢b(x):B(x). \\Gamma, x: A \\vdash b(x): B(x). Γ,x:A⊢b(x):B(x). Vemos que bbb es una elección de un elemento de cada B(x)B(x)B(x), el tipo de la salida depende de x:Ax: Ax:A. La asignación x↦b(x)x \\mapsto b(x)x↦b(x) es, en este sentido, una función dependiente. El tipo de todas estas funciones es llamado tipo función dependiente, y lo escribimos como Π(x:A)B(x). \\Pi_{(x: A)} B(x). Π(x:A)​B(x). Hay cuatro reglas principales para los Π\\PiΠ-tipos:\nLa regla de formación, que nos dice como formar tipos función dependiente. La regla de introducción, que nos dice como introducir términos del tipo función dependiente. La regla de eliminación, que nos dice como usar términos arbitrarios del tipo función dependiente. Las reglas de computación, que nos dicen como interactúan las reglas de introducción y de eliminación. En los casos de las reglas de formación, introducción y eliminación, también necesitamos reglas que afirmen que estas construcciones preservar la igualdad juiciosa. Estas reglas son llamadas reglas de congruencia.\nLa regla de Π\\PiΠ-formación La regla de Π\\PiΠ-formación nos dice cómos e construyen los Π\\PiΠ-tipos. La idea es que Π(x:A)B(x)\\Pi_{(x: A)} B(x)Π(x:A)​B(x) es un tipo función dependiente, para cada familia de tipos BBB sobre AAA, de modo que la regla de PiPiPi-formación dice: Γ,x:A⊢B(x) typeΓ⊢Π(x:A)B(x) typeΠ. \\frac{\\Gamma, x: A \\vdash B(x) ~~~ \\text{type}}{\\Gamma \\vdash \\Pi_{(x: A)} B(x) ~~~ \\text{type}} \\Pi. Γ⊢Π(x:A)​B(x) typeΓ,x:A⊢B(x) type​Π. Esta regla simplemente dice que para formar el tipo Π(x:A)B(x)\\Pi_{(x: A)} B(x)Π(x:A)​B(x) en el contexto Γ\\GammaΓ, debemos tener una familia de tipos BBB sobre AAA en el contexto Γ\\GammaΓ.\nTambién requerimos que la regla de formación de tipos función dependiente preserva la igualdad juiciosa. Es decir, tenemos la regla de congruencia para Π\\PiΠ-tipos: Γ⊢A=⋅A′ type Γ,x:A⊢B(x)=⋅B′(x) typeΓ⊢Π(x:A)B(x)B(x)=⋅Π(x:A′)B′(x) typeΠ−eq \\frac {\\Gamma \\vdash A \\stackrel{\\cdot}{=} A' ~~~ \\text{type} ~~~ ~~~ \\Gamma,x: A \\vdash B(x) \\stackrel{\\cdot}{=} B'(x) ~~~ \\text{type}} {\\Gamma \\vdash \\Pi_{(x: A)} B(x) B(x) \\stackrel{\\cdot}{=} \\Pi_{(x: A')} B'(x) ~~~ \\text{type}} \\Pi-eq Γ⊢Π(x:A)​B(x)B(x)=⋅Π(x:A′)​B′(x) typeΓ⊢A=⋅A′ type Γ,x:A⊢B(x)=⋅B′(x) type​Π−eqLa regla de Π\\PiΠ-introducción"},"title":"Funciones dependientes"}}